Fabio3rs/Monomotronic-MA1.7-Scanner/ESP32/ESP32Monomotronic.cpp
/*
https://github.com/Fabio3rs/Monomotronic-MA1.7-Scanner

MIT License

Copyright (c) 2019 Fabio3rs

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
*/

#include "ESP32Monomotronic.h"
#include "SensorCatalog.h"

namespace {
constexpr uint32_t kIdleYieldMs = 1;

struct ErrorCodeEntry {
    int code;
    const char *description;
};

constexpr std::array<ErrorCodeEntry, 11> kErrorCodeEntries{{
    {0x1A01, "Atuador de marcha lenta - Sinal ruim? Motor com do "
             "atuador de passo com defeito? Travado?"},
    {0x0302, "Sensor de rotacao do virabrequim | Sem sinal/motor desligado"},
    {0x0402, "Interruptor do atuador de marcha lenta | Curto ao GND ou VCC"},
    {0x0602, "Erro TPS"},
    {0x0A02, "Sensor de temperatura do liquido de arrefecimento"},
    {0x0B02, "Sensor de temperatura do ar circuito aberto ou curto para GND "
             "ou VCC"},
    {0x0D02, "Sonda lambda | problema sinal"},
    {0x3102, "Erro de correcao de mistura"},
    {0x0303, "Sensor de rotacao do virabrequim | Erro de sincronismo do "
             "sensor de posicao do virabrequim"},
    {0x3A46, "Imobilizador | Ativo"},
    {0xFFFF, "Erro de ECU | Defeito no computador ou selecionado "
             "incorretamente OU problema de conexao"},
}};

uint32_t DeadlineFromNow(uint32_t timeout_ms) { return millis() + timeout_ms; }

bool DeadlineReached(uint32_t deadline_ms) {
    return static_cast<int32_t>(millis() - deadline_ms) >= 0;
}

const char *OperationName(ESP32Monomotronic::OperationKind operation) {
    switch (operation) {
    case ESP32Monomotronic::OperationKind::ReadErrors:
        return "read_errors";
    case ESP32Monomotronic::OperationKind::ReadSensor:
        return "read_sensor";
    case ESP32Monomotronic::OperationKind::ReadMemory:
        return "read_memory";
    case ESP32Monomotronic::OperationKind::ReadCollection:
        return "read_collection";
    case ESP32Monomotronic::OperationKind::ClearErrors:
        return "clear_errors";
    case ESP32Monomotronic::OperationKind::DetermineCollectionTable:
        return "determine_collection_table";
    case ESP32Monomotronic::OperationKind::None:
    default:
        return "none";
    }
}
} // namespace

void ESP32Monomotronic::sendInitPins(uint8_t port1, uint8_t port2,
                                     uint8_t value) {
    digitalWrite(port1, value);
    digitalWrite(port2, value);
    delay(200);
}

bool ESP32Monomotronic::baudInit() {
    digitalWrite(config_.tx_init_pin, HIGH);
    digitalWrite(config_.aux_init_pin, HIGH);
    delay(200);

    const uint8_t address = config_.init_address;
    for (uint8_t bit = 0; bit < 8; ++bit) {
        const bool high = (address & (1 << bit)) == 0;
        sendInitPins(config_.tx_init_pin, config_.aux_init_pin,
                     high ? HIGH : LOW);
    }

    digitalWrite(config_.tx_init_pin, LOW);
    digitalWrite(config_.aux_init_pin, LOW);
    return true;
}

void ESP32Monomotronic::updatePacketCounter(ESP32Monomotronic &mm,
                                            const ECUmmpacket &p) {
    if (p.counter > mm.ECUPacketCounter_) {
        mm.ECUPacketCounter_ = p.counter;
    }
}

void ESP32Monomotronic::recordPacketActivity(bool sent) {
    if (sent) {
        packets_sent_.fetch_add(1, std::memory_order_relaxed);
    } else {
        packets_received_.fetch_add(1, std::memory_order_relaxed);
    }
    last_packet_ms_.store(millis(), std::memory_order_relaxed);
}

bool ESP32Monomotronic::tryStartOperation(OperationKind operation) {
    OperationKind expected = OperationKind::None;
    return activeOperation_.compare_exchange_strong(expected, operation);
}

void ESP32Monomotronic::finishOperation() {
    activeOperation_.store(OperationKind::None, std::memory_order_relaxed);
}

void ESP32Monomotronic::resetInitPackets() {
    std::lock_guard<std::mutex> lock(initPacketsMutex_);
    initPackets_.clear();
}

bool ESP32Monomotronic::appendInitPacket(const ECUmmpacket &packet) {
    std::lock_guard<std::mutex> lock(initPacketsMutex_);
    return initPackets_.add(packet);
}

bool ESP32Monomotronic::getInitPacketsSnapshot(
    ECUResponseCollection &out) const {
    if (!initPacketsOk_) {
        return false;
    }

    std::lock_guard<std::mutex> lock(initPacketsMutex_);
    out = initPackets_;
    return true;
}

const char *ESP32Monomotronic::getCurrentOperationName() const {
    return OperationName(activeOperation_.load(std::memory_order_relaxed));
}

const char *ESP32Monomotronic::getProtocolStateName() const {
    if (isBusy()) {
        return "busy";
    }

    if (ECUConnected_ && ECUThreadCanAcceptCommands_) {
        return "ready";
    }

    if (inited_.load(std::memory_order_acquire) &&
        (taskState_.load(std::memory_order_relaxed) == 1 ||
         taskState_.load(std::memory_order_relaxed) == 2)) {
        return "handshaking";
    }

    if (ECUThreadErr_.load(std::memory_order_relaxed) != ERR_NONE) {
        return "error";
    }

    return "disconnected";
}

ECUStatusSnapshot ESP32Monomotronic::getStatusSnapshot() const {
    ECUStatusSnapshot snapshot;
    snapshot.protocol_state = getProtocolStateName();
    snapshot.current_operation = getCurrentOperationName();
    snapshot.connected = ECUConnected_.load(std::memory_order_relaxed);
    snapshot.can_accept_commands =
        ECUThreadCanAcceptCommands_.load(std::memory_order_relaxed);
    snapshot.busy = isBusy();
    snapshot.init_ready = initPacketsOk_.load(std::memory_order_relaxed);
    snapshot.echo_byte_present = baudEchoOK_.load(std::memory_order_relaxed);
    snapshot.thread_started = inited_.load(std::memory_order_acquire);
    snapshot.task_state = taskState_.load(std::memory_order_relaxed);
    snapshot.freertos_state = static_cast<int>(getThreadState());
    snapshot.error_code = ECUThreadErr_.load(std::memory_order_relaxed);
    snapshot.debug_line = debug_line_.load(std::memory_order_relaxed);
    return snapshot;
}

ECUByte ESP32Monomotronic::ECURead(uint32_t timeout) {
    const uint32_t deadline = DeadlineFromNow(timeout);

