Fabio3rs/Monomotronic-MA1.7-Scanner/ESP32/ESP32Monomotronic.cpp
    while (!DeadlineReached(deadline)) {
        if (Serial2.available() > 0) {
            uint8_t code = static_cast<uint8_t>(Serial2.read() & 0xFF);
            return code;
        }
        delay(kIdleYieldMs);
    }

    timeouts_.fetch_add(1, std::memory_order_relaxed);
    return nullopt;
}

bool ESP32Monomotronic::ECUWrite(uint8_t b) {
    Serial2.write(b);
    Serial2.flush();

    const uint32_t deadline = DeadlineFromNow(config_.write_timeout_ms);
    while (!DeadlineReached(deadline)) {
        if (Serial2.available() > 0) {
            int code = Serial2.read();
            if (code != b) {
                ack_errors_.fetch_add(1, std::memory_order_relaxed);
                return false;
            }
            return true;
        }
        delay(kIdleYieldMs);
    }

    timeouts_.fetch_add(1, std::memory_order_relaxed);
    return false;
}

ECUByte ESP32Monomotronic::ECUReadAndResponse(uint32_t timeout) {
    ECUByte val = ECURead(timeout);

    if (val.has_value()) {
        uint8_t v = val.value();
        Serial2.write(static_cast<uint8_t>(~v));
        Serial2.flush();
        return val;
    }

    return nullopt;
}

bool ESP32Monomotronic::ECUWriteWaitResponse(uint8_t b, uint32_t timeout) {
    if (!ECUWrite(b)) {
        return false;
    }

    ECUByte val = ECURead(timeout);
    if (!val.has_value()) {
        return false;
    }

    if (val.value() != static_cast<uint8_t>(~b)) {
        ack_errors_.fetch_add(1, std::memory_order_relaxed);
        return false;
    }

    return true;
}

bool ESP32Monomotronic::ECUReadSequential(uint8_t *buffer, uint8_t size,
                                          uint32_t timeout) {
    for (uint8_t i = 0; i < size; ++i) {
        ECUByte r = ECUReadAndResponse(timeout);
        if (!r.has_value()) {
            return false;
        }
        buffer[i] = r.value();
    }

    return true;
}

bool ESP32Monomotronic::ECUWriteSequential(const uint8_t *data, uint8_t size,
                                           uint32_t timeout) {
    for (uint8_t i = 0; i < size; ++i) {
        if (!ECUWriteWaitResponse(data[i], timeout)) {
            return false;
        }
    }

    return true;
}

optional<ECUmmpacket> ESP32Monomotronic::ECUReadPacket(uint32_t timeout) {
    ECUmmpacket result;

    ECUByte size = ECUReadAndResponse(timeout);
    if (!size.has_value()) {
        ECUThreadErr_ = ERR_PACKET_READ;
        return nullopt;
    }
    result.size = size.value();

    if (result.size < 3 || result.size > (3 + ECUmmpacket::MAX_DATA_SIZE)) {
        ECUThreadErr_ = ERR_PACKET_SIZE;
        packet_errors_.fetch_add(1, std::memory_order_relaxed);
        return nullopt;
    }

    ECUByte counter = ECUReadAndResponse(timeout);
    if (!counter.has_value()) {
        ECUThreadErr_ = ERR_PACKET_READ;
        return nullopt;
    }
    result.counter = counter.value();

    ECUByte frameid = ECUReadAndResponse(timeout);
    if (!frameid.has_value()) {
        ECUThreadErr_ = ERR_PACKET_READ;
        return nullopt;
    }
    result.frametypeid = frameid.value();

    result.data_length = static_cast<uint8_t>(result.size - 3);
    if (result.data_length > 0 &&
        !ECUReadSequential(result.data.data(), result.data_length, timeout)) {
        ECUThreadErr_ = ERR_PACKET_READ;
        return nullopt;
    }

    ECUByte end = ECURead(timeout);
    if (!end.has_value() || end.value() != 0x03) {
        ECUThreadErr_ = ERR_PACKET_END;
        packet_errors_.fetch_add(1, std::memory_order_relaxed);
        return nullopt;
    }
    result.end = end.value();

    recordPacketActivity(false);
    return result;
}

bool ESP32Monomotronic::ECUWritePacket(uint8_t frameid, const uint8_t *data,
                                       uint8_t length, uint32_t timeout) {
    if (length > ECUmmpacket::MAX_DATA_SIZE) {
        return false;
    }

    const uint8_t packetSize = static_cast<uint8_t>(3 + length);

    if (!ECUWriteWaitResponse(packetSize, timeout)) {
        return false;
    }
    if (!ECUWriteWaitResponse(++ECUPacketCounter_, timeout)) {
        return false;
    }
    if (!ECUWriteWaitResponse(frameid, timeout)) {
        return false;
    }
    if (length > 0 && !ECUWriteSequential(data, length, timeout)) {
        return false;
    }
    if (!ECUWrite(0x03)) {
        return false;
    }

    recordPacketActivity(true);
    return true;
}

optional<ECUmmpacket> ESP32Monomotronic::getECUResponse() {
    if (ECUCommandResultAvailable_) {
        ECUCommandResultAvailable_ = false;
        return ECUResponse_;
    }
    return nullopt;
}

bool ESP32Monomotronic::sendECURequest(uint8_t frameid, const uint8_t *data,
                                       uint8_t length) {
    if (!ECUThreadCanAcceptCommands_ || length > pendingCommand_.data.size()) {
        return false;
    }

    std::lock_guard<std::mutex> lck(commandMutex_);
    pendingCommand_.frameid = frameid;
    pendingCommand_.data_length = length;
    for (uint8_t i = 0; i < length; ++i) {
        pendingCommand_.data[i] = data[i];
    }
    ECUNewCommandAvailable_ = true;
    return true;
}

bool ESP32Monomotronic::waitForResponse(optional<ECUmmpacket> &response,
                                        uint32_t timeout_ms) {
    const uint32_t deadline = DeadlineFromNow(timeout_ms);
    while (!DeadlineReached(deadline) && !stopRequested_) {
        response = getECUResponse();
        if (response.has_value()) {
            return true;
        }
        delay(kIdleYieldMs);
    }

    timeouts_.fetch_add(1, std::memory_order_relaxed);
    return false;
}

optional<ECUResponseCollection>
ESP32Monomotronic::ECURequestData(uint8_t frameid, uint8_t expectedFrame,
                                  const uint8_t *data, uint8_t length,
                                  uint32_t timeout) {
    if (!sendECURequest(frameid, data, length)) {
        retries_.fetch_add(1, std::memory_order_relaxed);
        return nullopt;
    }

    ECUResponseCollection responses;
    uint8_t currentFrame = 0;
    do {
        optional<ECUmmpacket> packet;
        if (!waitForResponse(packet, timeout) || !packet.has_value()) {
            return nullopt;
        }

        currentFrame = packet.value().frametypeid;
        if (currentFrame != ECU_ACK_CODE && currentFrame != expectedFrame) {
            ECUThreadErr_ = ERR_PACKET_UNEXPECTED;
            packet_errors_.fetch_add(1, std::memory_order_relaxed);
            return nullopt;
        }

