Fabio3rs/Monomotronic-MA1.7-Scanner/ESP32/ESP32Monomotronic.cpp
        if (!responses.add(packet.value())) {
            ECUThreadErr_ = ERR_PACKET_SIZE;
            packet_errors_.fetch_add(1, std::memory_order_relaxed);
            return nullopt;
        }

        if (currentFrame != ECU_ACK_CODE) {
            bool sendACK = false;
            do {
                sendACK = sendECURequest(ECU_ACK_CODE, nullptr, 0);
                if (!sendACK) {
                    delay(kIdleYieldMs);
                }
            } while (!sendACK);
        }
    } while (currentFrame != ECU_ACK_CODE);

    return responses;
}

optional<ECUResponseCollection> ESP32Monomotronic::ECUReadErrors() {
    if (!tryStartOperation(OperationKind::ReadErrors)) {
        return nullopt;
    }
    std::lock_guard<std::mutex> lock(sessionMutex_);
    optional<ECUResponseCollection> result =
        ECURequestData(ECU_READ_ERRORS_CODE, ECU_ERROR_DATA_CODE, nullptr, 0,
                       config_.command_timeout_ms);
    finishOperation();
    return result;
}

optional<ECUResponseCollection>
ESP32Monomotronic::ECUReadSensor(uint8_t sensorID) {
    if (!tryStartOperation(OperationKind::ReadSensor)) {
        return nullopt;
    }
    std::lock_guard<std::mutex> lock(sessionMutex_);
    const uint8_t request[]{0x01u, 0x00u, sensorID};
    optional<ECUResponseCollection> result =
        ECURequestData(ECU_DATA_MEMORY_READ, ECU_READ_DATA_CODE, request,
                       sizeof(request), config_.command_timeout_ms);
    finishOperation();
    return result;
}

optional<ECUResponseCollection>
ESP32Monomotronic::readECUMemory(uint8_t addressHigh, uint8_t addressLow,
                                 uint8_t length) {
    if (!tryStartOperation(OperationKind::ReadMemory)) {
        return nullopt;
    }
    std::lock_guard<std::mutex> lock(sessionMutex_);
    if (length == 0 || length > 0x0C) {
        ECUThreadErr_ = ERR_PACKET_SIZE;
        finishOperation();
        return nullopt;
    }

    const uint8_t request[]{length, addressHigh, addressLow};
    optional<ECUResponseCollection> result =
        ECURequestData(ECU_DATA_MEMORY_READ, ECU_READ_DATA_CODE, request,
                       sizeof(request), config_.command_timeout_ms);
    finishOperation();
    return result;
}

optional<ECUResponseCollection> ESP32Monomotronic::requestSensorCollection() {
    if (!tryStartOperation(OperationKind::ReadCollection)) {
        return nullopt;
    }
    std::lock_guard<std::mutex> lock(sessionMutex_);
    optional<ECUResponseCollection> result =
        ECURequestData(ECU_REQ_SENSOR_COLLECTION, ECU_RESP_SENSOR_COLLECTION,
                       nullptr, 0, config_.command_timeout_ms);
    finishOperation();
    return result;
}

optional<ECUmmpacket> ESP32Monomotronic::ECUCleanErrors() {
    if (!tryStartOperation(OperationKind::ClearErrors)) {
        return nullopt;
    }
    std::lock_guard<std::mutex> lock(sessionMutex_);
    if (!canAcceptCommands()) {
        finishOperation();
        return nullopt;
    }

    optional<ECUmmpacket> ecuptmp;
    const uint32_t deadline = DeadlineFromNow(config_.command_timeout_ms);

    bool sent = false;
    do {
        sent = sendECURequest(ECU_CLEAR_ERRORS_CODE, nullptr, 0);
        if (!sent) {
            delay(10);
        }
    } while (!sent && !DeadlineReached(deadline));

    if (!sent) {
        ECUThreadErr_ = ERR_CLEAR_SEND_TIMEOUT;
        timeouts_.fetch_add(1, std::memory_order_relaxed);
        finishOperation();
        return nullopt;
    }

    while (!DeadlineReached(deadline) && !stopRequested_) {
        ecuptmp = getECUResponse();
        if (ecuptmp.has_value()) {
            finishOperation();
            return ecuptmp;
        }
        delay(kIdleYieldMs);
    }

    ECUThreadErr_ = ERR_CLEAR_RESPONSE_TIMEOUT;
    timeouts_.fetch_add(1, std::memory_order_relaxed);
    finishOperation();
    return nullopt;
}

uint8_t ESP32Monomotronic::determineCollectionTable() {
    if (!tryStartOperation(OperationKind::DetermineCollectionTable)) {
        return 0;
    }
    std::lock_guard<std::mutex> lock(sessionMutex_);
    const uint8_t request[]{0x01u, 0x00u, 0xB3u};
    optional<ECUResponseCollection> response =
        ECURequestData(ECU_DATA_MEMORY_READ, ECU_READ_DATA_CODE, request,
                       sizeof(request), config_.command_timeout_ms);
    if (!response.has_value()) {
        finishOperation();
        return 0;
    }

    for (size_t i = 0; i < response.value().count; ++i) {
        const ECUmmpacket &pkt = response.value().packets[i];
        if (pkt.frametypeid == ECU_ACK_CODE || pkt.data_length == 0) {
            continue;
        }

        const uint8_t ram_b3 = pkt.data[0];
        if (ram_b3 & 0x01) {
            last_collection_table_.store(2, std::memory_order_relaxed);
            finishOperation();
            return 2;
        }
        if (ram_b3 & 0x02) {
            last_collection_table_.store(1, std::memory_order_relaxed);
            finishOperation();
            return 1;
        }
    }

    last_collection_table_.store(0, std::memory_order_relaxed);
    finishOperation();
    return 0;
}

const char *ESP32Monomotronic::errorPacketToString(const ECUmmpacket &p,
                                                   bool &present,
                                                   TextLocale locale) {
    present = false;
    if (p.frametypeid != ECU_ERROR_DATA_CODE) {
        return locale == TextLocale::PtBr ? "Nao e um pacote de erro"
                                          : "Not an error packet";
    }

    if (p.data_length < 3) {
        return locale == TextLocale::PtBr ? "Pacote de erro invalido"
                                          : "Invalid error packet";
    }

    /*
    1E - Error present?
    9E - Error intermitent?
    */
    int errcode =
        static_cast<int>(p.data[0]) | (static_cast<int>(p.data[1]) << 8);
    present = (p.data[2] == 0x1E || p.data[2] == 0x03);

    for (const ErrorCodeEntry &entry : kErrorCodeEntries) {
        if (entry.code == errcode) {
            return entry.description;
        }
    }

