Fabio3rs/Monomotronic-MA1.7-Scanner/ESP32/ESP32Monomotronic.cpp
    return locale == TextLocale::PtBr ? "Codigo de erro desconhecido"
                                      : "Unknown error code";
}

ECUHealthSnapshot ESP32Monomotronic::getHealthSnapshot() const {
    ECUHealthSnapshot snapshot;
    snapshot.packets_sent = packets_sent_.load(std::memory_order_relaxed);
    snapshot.packets_received =
        packets_received_.load(std::memory_order_relaxed);
    snapshot.timeouts = timeouts_.load(std::memory_order_relaxed);
    snapshot.retries = retries_.load(std::memory_order_relaxed);
    snapshot.reconnects = reconnects_.load(std::memory_order_relaxed);
    snapshot.ack_errors = ack_errors_.load(std::memory_order_relaxed);
    snapshot.packet_errors = packet_errors_.load(std::memory_order_relaxed);
    snapshot.last_packet_ms = last_packet_ms_.load(std::memory_order_relaxed);
    snapshot.last_collection_table =
        last_collection_table_.load(std::memory_order_relaxed);
    return snapshot;
}

void ESP32Monomotronic::commThread(void *vpmm) {
    ESP32Monomotronic &mm = *(ESP32Monomotronic *)vpmm;
    mm.taskState_ = 0;
    mm.baudEchoOK_ = false;
    mm.ECUConnected_ = false;
    mm.initPacketsOk_ = false;
    mm.ECUThreadCanAcceptCommands_ = false;
    mm.stopRequested_ = false;

    Serial2.begin(mm.config_.session_baud, SERIAL_8N1);
    Serial2.flush();

    while (!mm.stopRequested_) {
        mm.taskState_ = 0;
        mm.ECUThreadErr_ = ERR_NONE;
        mm.resetInitPackets();
        mm.ECUConnected_ = false;
        mm.initPacketsOk_ = false;
        mm.ECUThreadCanAcceptCommands_ = false;
        mm.ECUNewCommandAvailable_ = false;
        mm.ECUCommandResultAvailable_ = false;
        mm.finishOperation();
        mm.reconnects_.fetch_add(1, std::memory_order_relaxed);

        while (Serial2.available() > 0) {
            Serial2.read();
        }
        Serial2.flush();

        mm.baudInit();

        uint8_t key1 = 0;
        uint8_t key2 = 0;
        uint8_t key3 = 0;
        uint8_t key4 = 0;
        int state = 0;
        mm.taskState_ = 1;
        const uint32_t keyDeadline = DeadlineFromNow(6000);

        while (!DeadlineReached(keyDeadline) && state != 5 &&
               !mm.stopRequested_) {
            ECUByte code = mm.ECURead(200);
            if (!code.has_value()) {
                continue;
            }

            switch (state) {
            case 0:
                if (code.value() == 0x55) {
                    ++state;
                } else if (code.value() == 0x00) {
                    mm.baudEchoOK_ = true;
                }
                break;
            case 1:
                key1 = code.value();
                (void)key1;
                ++state;
                break;
            case 2:
                key2 = code.value();
                ++state;
                break;
            case 3:
                key3 = code.value();
                (void)key3;
                ++state;
                break;
            case 4:
                key4 = code.value();
                (void)key4;
                ++state;
                break;
            default:
                break;
            }
        }

        if (state <= 1 || !mm.ECUWrite(static_cast<uint8_t>(~key2 & 0xFF))) {
            mm.debug_regiter_err(__FILE__, __LINE__);
            mm.ECUThreadErr_ =
                (state <= 1) ? ERR_HANDSHAKE_TIMEOUT : ERR_HANDSHAKE_KEY;
            delay(1000);
            continue;
        }

        mm.taskState_ = 2;
        mm.ECUConnected_ = true;

        while (true) {
            optional<ECUmmpacket> p =
                mm.ECUReadPacket(mm.config_.command_timeout_ms);
            if (!p.has_value()) {
                mm.debug_regiter_err(__FILE__, __LINE__);
                mm.ECUConnected_ = false;
                break;
            }

            updatePacketCounter(mm, p.value());
            if (!mm.appendInitPacket(p.value())) {
                mm.ECUThreadErr_ = ERR_PACKET_SIZE;
                mm.ECUConnected_ = false;
                break;
            }

            if (p.value().frametypeid == ECU_ACK_CODE) {
                break;
            }

            if (!mm.ECUWritePacket(ECU_ACK_CODE, nullptr, 0,
                                   mm.config_.write_timeout_ms)) {
                mm.debug_regiter_err(__FILE__, __LINE__);
                mm.ECUThreadErr_ = ERR_KEEPALIVE;
                mm.ECUConnected_ = false;
                break;
            }
        }

        if (!mm.ECUConnected_) {
            delay(1000);
            continue;
        }

        mm.taskState_ = 4;
        mm.initPacketsOk_ = true;
        mm.ECUThreadCanAcceptCommands_ = true;
        uint32_t lastPacketTime = millis();

        while (!mm.stopRequested_) {
            if (mm.ECUNewCommandAvailable_) {
                PendingCommand commandCopy;
                {
                    std::lock_guard<std::mutex> lck(mm.commandMutex_);
                    commandCopy = mm.pendingCommand_;
                }

                if (!mm.ECUWritePacket(
                        commandCopy.frameid, commandCopy.data.data(),
                        commandCopy.data_length, mm.config_.write_timeout_ms)) {
                    mm.debug_regiter_err(__FILE__, __LINE__);
                    mm.ECUThreadErr_ = ERR_PACKET_WRITE;
                    mm.ECUConnected_ = false;
                    break;
                }

                optional<ECUmmpacket> response =
                    mm.ECUReadPacket(mm.config_.command_timeout_ms);
                if (!response.has_value()) {
                    mm.debug_regiter_err(__FILE__, __LINE__);
                    mm.ECUThreadErr_ = ERR_PACKET_READ;
                    mm.ECUConnected_ = false;
                    break;
                }

                updatePacketCounter(mm, response.value());
                mm.ECUResponse_ = response.value();
                mm.ECUCommandResultAvailable_ = true;
                mm.ECUNewCommandAvailable_ = false;
                lastPacketTime = millis();
            }

            if ((millis() - lastPacketTime) > mm.config_.keep_alive_ms) {
                if (!mm.ECUWritePacket(ECU_ACK_CODE, nullptr, 0,
                                       mm.config_.write_timeout_ms)) {
                    mm.debug_regiter_err(__FILE__, __LINE__);
                    mm.ECUThreadErr_ = ERR_KEEPALIVE;
                    mm.ECUConnected_ = false;
                    break;
                }

                optional<ECUmmpacket> ack =
                    mm.ECUReadPacket(mm.config_.command_timeout_ms);
                if (!ack.has_value() ||
                    ack.value().frametypeid !=
                        static_cast<uint8_t>(ECU_ACK_CODE)) {
                    mm.debug_regiter_err(__FILE__, __LINE__);
                    mm.ECUThreadErr_ = ERR_KEEPALIVE;
                    mm.ECUConnected_ = false;
                    break;
                }

                updatePacketCounter(mm, ack.value());
                lastPacketTime = millis();
            }

            delay(kIdleYieldMs);
        }

        mm.ECUThreadCanAcceptCommands_ = false;
        mm.initPacketsOk_ = false;
        mm.ECUConnected_ = false;
        delay(1000);
    }

    mm.ECUThreadCanAcceptCommands_ = false;
    mm.finishOperation();
    mm.inited_.store(false, std::memory_order_release);
    vTaskDelete(nullptr);
}

bool ESP32Monomotronic::init() {
    std::lock_guard<std::mutex> lock(initMutex_);
    if (inited_.load(std::memory_order_acquire)) {
        return false;
    }

    taskState_ = 0;
    ECUPacketCounter_ = 0;
    resetInitPackets();
    finishOperation();
    Task1_ = nullptr;

    const BaseType_t created = xTaskCreatePinnedToCore(
        commThread, "ECUComm", 12000, this, 32, &Task1_, 1);
    if (created != pdPASS || Task1_ == nullptr) {
        ECUThreadErr_ = ERR_TASK_CREATE;
        return false;
    }

    inited_.store(true, std::memory_order_release);
    return true;
}

ESP32Monomotronic::ESP32Monomotronic() {
    taskState_ = 0;
    ECUThreadErr_ = ERR_NONE;
    ECUThreadCanAcceptCommands_ = false;
    ECUNewCommandAvailable_ = false;
    ECUCommandResultAvailable_ = false;
    stopRequested_ = false;
}
